# IF-ELIF-ELSE:
# Filename: if.py
"""
    Αρχικά αποθηκεύεται σε μία ακέραια μεταβλητή num η τιμή 34,
    στη συνέχεια ζητάει από τον χρήστη να δώσει έναν αριθμό,
    ο οποίος αποθηκεύεται στη μεταβλητή UserGuess.
    Στη συνέχεια ελέγχει αν ο UserGuess είναι ίσος με τον num
    και αν είναι δίνει συγχαρητήρια στον χρήστη που τον μάντεψε,
    αν δεν είναι ίσος τότε ελέγχει αν είναι μεγαλύτερος ο UserGuess
    από τον num και εμφανίζει το αντίστοιχο μήνυμα,
    και αν δεν είναι ούτε μεγαλύτερος τότε εμφανίζει ότι είναι μικρότερος.
"""
num = 34
UserGuess = int(input('Εισάγετε έναν ακέραιο αριθμό: '))
if UserGuess == num:
    print('Συγχαρητήρια, τον μαντέψατε.')
    print('(Αλλά δεν κερδίζετε και κανένα βραβείο!)')
elif UserGuess < num:
    print('Όχι, είναι λίγο μεγαλύτερος.')
else:
    print('Όχι, είναι λίγο μικρότερος.')
print('Τέλος')

# WHILE:

# Filename: while.py
"""
    Αρχικά αποθηκεύεται σε μία bool μεταβλητή run, η τιμή True και σε μία ακέραια μεταβλητή num η τιμή 49,
    στη συνέχεια ελέγχεται επαναλαμβανόμενα αν η μεταβλητή run είναι True 
    κάνοντας την ίδια διαδικασία με πιο πάνω μέχρι ο χρήστης να μαντέψει σωστά τον αριθμό.
"""
run = True
num = 49
while run:
    UserGuess = int(input('Εισάγετε έναν ακέραιο αριθμό: '))
    if UserGuess == num:
        print('Συγχαρητήρια, τον μαντέψατε.')
        run = False # αυτό κάνει τον βρόχο while να σταματήσει εδώ
    elif UserGuess < num:
        print('Όχι, είναι λίγο μεγαλύτερος.')
    else:
        print('Όχι, είναι λίγο μικρότερος.')

print('Ο βρόχος while τερματίστηκε.')
print('Τέλος')

# For i range():
# Filename: func_param.py
"""
 Αρχικά στο X αποθηκεύεται η τιμή 2 και ελέγχεται συνεχώς μέχρι το X να πάρει την τιμή 8, εκτυπώνοντας 
 κάθε φορά την τιμή του Χ. Δηλαδή σε αυτήν την περίπτωση θα εκτυπώσει τα εξής:
    2
    3
    4
    5
    6
    7
    Ο βρόχος loop τερματίστηκε
 
"""
for X in range(2, 8):
    print(X)
else:
    print('Ο βρόχος loop τερματίστηκε')

