"""
    Αρχικά αποθηκεύεται σε μία ακέραια μεταβλητή num η τιμή 34,
    στη συνέχεια ζητάει από τον χρήστη να δώσει έναν αριθμό,
    ο οποίος αποθηκεύεται στη μεταβλητή UserGuess.
    Στη συνέχεια ελέγχει αν ο UserGuess είναι ίσος με τον num
    και αν είναι δίνει συγχαρητήρια στον χρήστη που τον μάντεψε,
    αν δεν είναι ίσος τότε ελέγχει αν είναι μεγαλύτερος ο UserGuess
    από τον num και εμφανίζει το αντίστοιχο μήνυμα,
    και αν δεν είναι ούτε μεγαλύτερος τότε εμφανίζει ότι είναι μικρότερος.
"""
num = 34
UserGuess = int(input('Εισάγετε έναν ακέραιο αριθμό: '))
if UserGuess == num:
    print('Συγχαρητήρια, τον μαντέψατε.')
    print('(Αλλά δεν κερδίζετε και κανένα βραβείο!)')
elif UserGuess < num:
    print('Όχι, είναι λίγο μεγαλύτερος.')
else:
    print('Όχι, είναι λίγο μικρότερος.')
print('Τέλος')