"""
    Αρχικά αποθηκεύεται σε μία bool μεταβλητή run, η τιμή True και σε μία ακέραια μεταβλητή num η τιμή 49,
    στη συνέχεια ελέγχεται επαναλαμβανόμενα αν η μεταβλητή run είναι True
    κάνοντας την ίδια διαδικασία με πιο πάνω μέχρι ο χρήστης να μαντέψει σωστά τον αριθμό.
"""
run = True
num = 49
while run:
    UserGuess = int(input('Εισάγετε έναν ακέραιο αριθμό: '))
    if UserGuess == num:
        print('Συγχαρητήρια, τον μαντέψατε.')
        run = False # αυτό κάνει τον βρόχο while να σταματήσει εδώ
    elif UserGuess < num:
        print('Όχι, είναι λίγο μεγαλύτερος.')
    else:
        print('Όχι, είναι λίγο μικρότερος.')

print('Ο βρόχος while τερματίστηκε.')
print('Τέλος')
