"""
    Ορίζεται η printMax η οποία παίρνει δύο παραμέτρους το l και το k και στη συνέχεια τα συγκρίνει.
    Δηλαδή αν το l είναι μεγαλύτερο απο το k
    εμφανίζει ότι το l είναι το μέγιστο
    αλλιώς αν το l είναι ίσο με το k εμφανίζει αντίστοιχα ότι το l είναι ίσο με το k
    αλλιώς εμφανίζει ότι το k είναι το μέγιστο.
    Στη συνέχεια καλείται αρχικά με παραμέτρους τους αριθμούς 9 ως το l και 2 ως το k
    και εμφανίζει ως αποτέλεσμα ότι το 9 είναι το μέγιστο μετά καλείται με τις μεταβλητές x ως l και y ως k,
    έχοντας το x να παίρνει την τιμή 3 και το y να παίρνει την τιμή 3 και να εμφανίζει ότι είναι ίσα.
"""
def printMax(l, k):
    if l > k:
        print(l, 'είναι το μέγιστο')
    elif l == k:
        print(l, 'είναι ίσο με το', k)
    else:
        print(k, 'είναι το μέγιστο')
printMax(9, 2)
y = 3
x = 3
printMax(x, y)

