"""
 Αρχικά δημιουργείται μία λίστα με διάφορα ψώνια, όπου
    εκτυπώνεται το μέγεθος της λίστας και το κάθε αντικείμενό της ξεχωριστά,
    προσθέτεται το ρύζι στη λίστα και εκτυπώνεται η νέα λίστα,
    εκτυπώνεται η λίστα ταξινομημένη,
    εκτυπώνεται το πρώτο αντικείμενο της λίστας ('χυμός πορτοκάλι') και αποθηκεύεται στη μεταβλητή olditem.
    Στη συνέχεια αφαιρείται ο 'χυμός πορτοκάλι' από τη λίστα δίοτι αγοράζεται και εκτυπώνεται
    το olditem καθώς και η ανανεωμένη λίστα.
"""
shoplist = ['χυμός πορτοκάλι', 'πατάτες', 'μπριζόλες',
'ντομάτες', 'μαγιονέζα']
print('Πρέπει ν\' αγοράσω', len(shoplist),
'πράγματα.')
print('Τα πράγματα αυτά είναι:', end=' ')
for item in shoplist:
    print(item, end=' ')
print('\nΠρέπει επίσης ν\' αγοράσω ρύζι.')
shoplist.append('ρύζι')
print('Η λίστα αγορών μου τώρα είναι:',
shoplist)
print('Θα ταξινομήσω τη λίστα μου τώρα')
shoplist.sort()
print('Η ταξινομημένη λίστα μου είναι',
      shoplist)
print('Το πρώτο πράγμα που θ\' αγοράσω είναι',
      shoplist[0])
olditem = shoplist[0]
del shoplist[0]
print('Αγόρασα το',
      olditem)
print('Η λίστα αγορών μου τώρα είναι',
      shoplist)